      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Divisiones.
       AUTHOR. Pablito Fernandez
       INSTALLATION.
       DATE-WRITTEN.21/11/2023
       DATE-COMPILED.
       REMARKS.Programa para ver las divisiones de COBOL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM Divisiones.
