000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "SHEET1".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-SHEET1 IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--SHEET1.
000013     03 SHEET1 PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  SHEET1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ETIQUETASALUDO.
000013     03 ETIQUETASALUDO PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  ETIQUETASALUDO USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-SHEET1.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 2 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017 CONSTANT SECTION.
000018 LINKAGE SECTION.
000019 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000020 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000021                    USAGE IS COMPUTATIONAL-5.
000022 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000023                    USAGE IS COMPUTATIONAL-5.
000024 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000025                    USAGE IS COMPUTATIONAL-5.
000026 PROCEDURE DIVISION
000027     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000028     EVALUATE POWER--MESSAGE
000029     WHEN 1024
000030         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000031     WHEN 1038
000032         CALL "SHEET1-START"
000033     END-EVALUATE
000034     EXIT PROGRAM.
000035 IDENTIFICATION DIVISION.
000036 PROGRAM-ID. "SHEET1-START".
000037 PROCEDURE DIVISION.
000038     EXIT PROGRAM.
000039 END PROGRAM "SHEET1-START".
000040 END PROGRAM "SHEET1".
